; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v2 ?v1)
             (pred_4 ?v9 ?v12)
             (pred_5 ?v2 ?v12)
             (pred_6 ?v6 ?v2 )
	     (pred_3 ?v2)
             (pred_10 ?v11)
             (pred_2 ?v9)
             (pred_1 ?v12)
             (pred_11 ?v2)
             (pred_8 ?v9)
             (pred_9 ?v2)
             (pred_7 ))



(:action op_2
:parameters (?v10 ?v13 ?v7 ?v8)
:precondition (and (pred_10 ?v10) (pred_10 ?v13) (pred_2 ?v7) (pred_1 ?v8)
          (pred_12 ?v10 ?v13) (pred_4 ?v7 ?v8)
                   (pred_5 ?v13 ?v8) (pred_3 ?v10) 
                   (pred_11 ?v13) (pred_8 ?v7))
:effect (and  (pred_9 ?v13) (not (pred_11 ?v13))))


(:action op_3
:parameters (?v10 ?v3)
:precondition (and (pred_10 ?v10) (pred_10 ?v3)
               (pred_3 ?v10) (pred_12 ?v10 ?v3) (pred_9 ?v3))
:effect (and (pred_3 ?v3) (not (pred_3 ?v10))))

(:action op_1
:parameters (?v10 ?v7)
:precondition (and (pred_10 ?v10) (pred_2 ?v7) 
                  (pred_3 ?v10) (pred_6 ?v7 ?v10) (pred_7 ))
:effect (and (pred_8 ?v7)
   (not (pred_6 ?v7 ?v10)) (not (pred_7 ))))


(:action op_5
:parameters (?v10 ?v5 ?v4)
:precondition (and (pred_10 ?v10) (pred_2 ?v5) (pred_2 ?v4)
                  (pred_3 ?v10) (pred_8 ?v4) (pred_6 ?v5 ?v10))
:effect (and (pred_8 ?v5) (pred_6 ?v4 ?v10)
        (not (pred_8 ?v4)) (not (pred_6 ?v5 ?v10))))

(:action op_4
:parameters (?v10 ?v7)
:precondition (and (pred_10 ?v10) (pred_2 ?v7) 
                  (pred_3 ?v10) (pred_8 ?v7))
:effect (and (pred_7 ) (pred_6 ?v7 ?v10) (not (pred_8 ?v7)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_03 obj_20 obj_14 obj_12 obj_24 obj_02 obj_17 obj_30 obj_29 obj_10 obj_16 obj_04 obj_13 obj_11 obj_32 obj_07 obj_15 obj_25 obj_01 obj_18 obj_08 obj_28 obj_31 obj_06 obj_22
    obj_21 obj_26 obj_19
    obj_05 obj_23 obj_27 obj_09
    )

    (:init
       (pred_7)

       (pred_10 obj_03)
       (pred_10 obj_20)
       (pred_10 obj_14)
       (pred_10 obj_12)
       (pred_10 obj_24)
       (pred_10 obj_02)
       (pred_10 obj_17)
       (pred_10 obj_30)
       (pred_10 obj_29)
       (pred_10 obj_10)
       (pred_10 obj_16)
       (pred_10 obj_04)
       (pred_10 obj_13)
       (pred_10 obj_11)
       (pred_10 obj_32)
       (pred_10 obj_07)
       (pred_10 obj_15)
       (pred_10 obj_25)
       (pred_10 obj_01)
       (pred_10 obj_18)
       (pred_10 obj_08)
       (pred_10 obj_28)
       (pred_10 obj_31)
       (pred_10 obj_06)
       (pred_10 obj_22)
       (pred_1 obj_21)
       (pred_1 obj_26)
       (pred_1 obj_19)
       (pred_2 obj_05)
       (pred_2 obj_23)
       (pred_2 obj_27)
       (pred_2 obj_09)

       (pred_12 obj_03 obj_02)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_20 obj_14)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_14 obj_30)
       (pred_12 obj_14 obj_12)
       (pred_12 obj_14 obj_20)
       (pred_12 obj_12 obj_29)
       (pred_12 obj_12 obj_24)
       (pred_12 obj_12 obj_14)
       (pred_12 obj_24 obj_10)
       (pred_12 obj_24 obj_12)
       (pred_12 obj_02 obj_16)
       (pred_12 obj_02 obj_17)
       (pred_12 obj_02 obj_03)
       (pred_12 obj_17 obj_04)
       (pred_12 obj_17 obj_30)
       (pred_12 obj_17 obj_20)
       (pred_12 obj_17 obj_02)
       (pred_12 obj_30 obj_13)
       (pred_12 obj_30 obj_29)
       (pred_12 obj_30 obj_14)
       (pred_12 obj_30 obj_17)
       (pred_12 obj_29 obj_11)
       (pred_12 obj_29 obj_10)
       (pred_12 obj_29 obj_12)
       (pred_12 obj_29 obj_30)
       (pred_12 obj_10 obj_32)
       (pred_12 obj_10 obj_24)
       (pred_12 obj_10 obj_29)
       (pred_12 obj_16 obj_07)
       (pred_12 obj_16 obj_04)
       (pred_12 obj_16 obj_02)
       (pred_12 obj_04 obj_15)
       (pred_12 obj_04 obj_13)
       (pred_12 obj_04 obj_17)
       (pred_12 obj_04 obj_16)
       (pred_12 obj_13 obj_25)
       (pred_12 obj_13 obj_11)
       (pred_12 obj_13 obj_30)
       (pred_12 obj_13 obj_04)
       (pred_12 obj_11 obj_01)
       (pred_12 obj_11 obj_32)
       (pred_12 obj_11 obj_29)
       (pred_12 obj_11 obj_13)
       (pred_12 obj_32 obj_18)
       (pred_12 obj_32 obj_10)
       (pred_12 obj_32 obj_11)
       (pred_12 obj_07 obj_08)
       (pred_12 obj_07 obj_15)
       (pred_12 obj_07 obj_16)
       (pred_12 obj_15 obj_28)
       (pred_12 obj_15 obj_25)
       (pred_12 obj_15 obj_04)
       (pred_12 obj_15 obj_07)
       (pred_12 obj_25 obj_31)
       (pred_12 obj_25 obj_01)
       (pred_12 obj_25 obj_13)
       (pred_12 obj_25 obj_15)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_01 obj_18)
       (pred_12 obj_01 obj_11)
       (pred_12 obj_01 obj_25)
       (pred_12 obj_18 obj_22)
       (pred_12 obj_18 obj_32)
       (pred_12 obj_18 obj_01)
       (pred_12 obj_08 obj_28)
       (pred_12 obj_08 obj_07)
       (pred_12 obj_28 obj_31)
       (pred_12 obj_28 obj_15)
       (pred_12 obj_28 obj_08)
       (pred_12 obj_31 obj_06)
       (pred_12 obj_31 obj_25)
       (pred_12 obj_31 obj_28)
       (pred_12 obj_06 obj_22)
       (pred_12 obj_06 obj_01)
       (pred_12 obj_06 obj_31)
       (pred_12 obj_22 obj_18)
       (pred_12 obj_22 obj_06)
       (pred_11 obj_10)
       (pred_11 obj_11)
       (pred_11 obj_31)
       (pred_11 obj_15)
       (pred_5  obj_10 obj_21)
       (pred_5  obj_11 obj_26)
       (pred_5  obj_31 obj_19)
       (pred_5  obj_15 obj_26)
       (pred_9 obj_03)
       (pred_9 obj_20)
       (pred_9 obj_14)
       (pred_9 obj_12)
       (pred_9 obj_24)
       (pred_9 obj_02)
       (pred_9 obj_17)
       (pred_9 obj_30)
       (pred_9 obj_29)
       (pred_9 obj_16)
       (pred_9 obj_04)
       (pred_9 obj_13)
       (pred_9 obj_32)
       (pred_9 obj_07)
       (pred_9 obj_25)
       (pred_9 obj_01)
       (pred_9 obj_18)
       (pred_9 obj_08)
       (pred_9 obj_28)
       (pred_9 obj_06)
       (pred_9 obj_22)

       (pred_4  obj_05 obj_21)
       (pred_4  obj_23 obj_26)
       (pred_4  obj_27 obj_19)
       (pred_4  obj_09 obj_19)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_23 obj_14)
       (pred_6 obj_27 obj_03)
       (pred_6 obj_09 obj_01)
       (pred_3 obj_14)
    )

    (:goal (and
       (pred_6 obj_05 obj_01)
       (pred_6 obj_23 obj_22)
       (pred_6 obj_27 obj_30)
    ))
(:constraints
  (always (not (pred_3 obj_18)))
)
)

; plan
1. (op_3 obj_14 obj_20)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_20)
   goals met: 0 of 3
2. (op_3 obj_20 obj_03)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_03)
   goals met: 0 of 3
3. (op_1 obj_03 obj_27)
   deleted: (pred_6 obj_27 obj_03) (pred_7)
   added: (pred_8 obj_27)
   goals met: 0 of 3
4. (op_3 obj_03 obj_20)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_20)
   goals met: 0 of 3
5. (op_3 obj_20 obj_14)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_14)
   goals met: 0 of 3
6. (op_3 obj_14 obj_30)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_30)
   goals met: 0 of 3
7. (op_4 obj_30 obj_27)
   deleted: (pred_8 obj_27)
   added: (pred_7) (pred_6 obj_27 obj_30)
   goals met: 1 of 3
8. (op_3 obj_30 obj_14)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_14)
   goals met: 1 of 3
9. (op_3 obj_14 obj_20)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_20)
   goals met: 1 of 3
10. (op_1 obj_20 obj_05)
   deleted: (pred_6 obj_05 obj_20) (pred_7)
   added: (pred_8 obj_05)
   goals met: 1 of 3
11. (op_3 obj_20 obj_14)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_14)
   goals met: 1 of 3
12. (op_3 obj_14 obj_30)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_30)
   goals met: 1 of 3
13. (op_4 obj_30 obj_05)
   deleted: (pred_8 obj_05)
   added: (pred_7) (pred_6 obj_05 obj_30)
   goals met: 1 of 3
14. (op_3 obj_30 obj_14)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_14)
   goals met: 1 of 3
15. (op_1 obj_14 obj_23)
   deleted: (pred_6 obj_23 obj_14) (pred_7)
   added: (pred_8 obj_23)
   goals met: 1 of 3
16. (op_3 obj_14 obj_30)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_30)
   goals met: 1 of 3
17. (op_3 obj_30 obj_13)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_13)
   goals met: 1 of 3
18. (op_4 obj_13 obj_23)
   deleted: (pred_8 obj_23)
   added: (pred_7) (pred_6 obj_23 obj_13)
   goals met: 1 of 3
19. (op_3 obj_13 obj_30)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_30)
   goals met: 1 of 3
20. (op_1 obj_30 obj_05)
   deleted: (pred_6 obj_05 obj_30) (pred_7)
   added: (pred_8 obj_05)
   goals met: 1 of 3
21. (op_3 obj_30 obj_13)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_13)
   goals met: 1 of 3
22. (op_3 obj_13 obj_25)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_25)
   goals met: 1 of 3
23. (op_3 obj_25 obj_01)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_01)
   goals met: 1 of 3
24. (op_4 obj_01 obj_05)
   deleted: (pred_8 obj_05)
   added: (pred_7) (pred_6 obj_05 obj_01)
   goals met: 2 of 3
25. (op_3 obj_01 obj_25)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_25)
   goals met: 2 of 3
26. (op_3 obj_25 obj_13)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_13)
   goals met: 2 of 3
27. (op_1 obj_13 obj_23)
   deleted: (pred_6 obj_23 obj_13) (pred_7)
   added: (pred_8 obj_23)
   goals met: 2 of 3
28. (op_3 obj_13 obj_25)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_25)
   goals met: 2 of 3
29. (op_3 obj_25 obj_01)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_01)
   goals met: 2 of 3
30. (op_3 obj_01 obj_06)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_06)
   goals met: 2 of 3
31. (op_3 obj_06 obj_22)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_22)
   goals met: 2 of 3
32. (op_4 obj_22 obj_23)
   deleted: (pred_8 obj_23)
   added: (pred_7) (pred_6 obj_23 obj_22)
   goals met: 3 of 3
